tests/resources/xml/SOAP11/env_Envelope.xml

<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:test="urn:test:something" test:attr1="testval1">
  <env:Header test:attr1="testval1">
    <m:GetPrice xmlns:m="https://www.w3schools.com/prices">
      <m:Item>Apples</m:Item>
    </m:GetPrice>
  </env:Header>
  <env:Body test:attr1="testval1">
    <m:GetPrice xmlns:m="https://www.w3schools.com/prices">
      <m:Item>Apples</m:Item>
    </m:GetPrice>
  </env:Body>
</env:Envelope>
